ART-Badge/SDK/libraries/src/app/wristband/inc/rtl876x_i2c_wristband.h
/**
*********************************************************************************************************
*               Copyright(c) 2015, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rtl876x_i2c.h
* @brief
* @details
* @author    elliot chen
* @date      2015-4-20
* @version   v1.0
* *********************************************************************************************************
*/

#ifndef __RTL876X_I2C_H
#define __RTL876X_I2C_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes ------------------------------------------------------------------*/
#include "rtl876x.h"
#include "rtl876x_bitfields.h"


/** @addtogroup I2C I2C
  * @brief I2C driver module
  * @{
  */

/*============================================================================*
 *                         Types
 *============================================================================*/


/** @defgroup I2C_Exported_Types I2C Exported Types
  * @{
  */

/**
  * @brief  I2C Init structure definition
  */

typedef struct
{
    uint32_t I2C_Clock;           /*!< the clock frequency,default 40000000.
                                                This parameter must be set with I2C clock div */

    uint32_t I2C_ClockSpeed;      /*!< Specifies the clock frequency.
                                                This parameter must be set to a value lower than 400kHz */

    uint16_t I2C_DeviveMode;      /*!< Specifies the I2C devie mode.
                                                This parameter can be a value of @ref I2C_device_mode */

    uint16_t I2C_AddressMode;     /*!< Specifies the I2C address mode.
                                                This parameter can be a value of @ref I2C_address_mode */

    uint16_t I2C_SlaveAddress;    /*!< Specifies the first device own address.
                                                This parameter can be a 7-bit or 10-bit address. */

    uint16_t I2C_Ack;             /*!< Enables or disables the acknowledgement only in slave mode.
                                                This parameter can be a value of @ref I2C_acknowledgement */

    uint32_t I2C_TxThresholdLevel;  /* !< Specifies the transmit FIFO Threshold to trigger interrupt I2C_INT_TX_EMPTY.
                                                This parameter can be a value less than 24*/

    uint32_t I2C_RxThresholdLevel;  /* !<Specifies the receive FIFO Threshold to trigger interrupt I2C_INT_RX_FULL.
                                                This parameter can be a value less than 16*/

    uint16_t I2C_TxDmaEn;               /*!< Specifies the Tx dma mode.
                                                This parameter can be a value of ENABLE or DISABLE*/

    uint16_t I2C_RxDmaEn;               /*!< Specifies the Rx dma mode
                                                This parameter can be a value of ENABLE or DISABLE*/

    uint8_t  I2C_TxWaterlevel;          /*!< Specifies the DMA tx water level
                                                This parameter should be I2C Tx fifo depth minus GDMA MSize */

    uint8_t  I2C_RxWaterlevel;          /*!< Specifies the DMA rx water level
                                                This parameter should be I2C Rx GDMA MSize - 1 */
    uint8_t I2C_SDA_Pin;
    uint8_t I2C_SCL_Pin;

} I2C_InitTypeDef;

/** End of group I2C_Exported_Types
  * @}
  */

/*============================================================================*
 *                         Constants
 *============================================================================*/


/** @defgroup I2C_Exported_Constants I2C Exported Constants
  * @{
  */

#define IS_I2C_ALL_PERIPH(PERIPH) (((PERIPH) == I2C0) || \
                                   ((PERIPH) == I2C1))

/** @defgroup I2C_clock_speed I2C Clock Speed
  * @{
  */

#define IS_I2C_CLOCK_SPEED(SPEED) (((SPEED) >= 0x01) && ((SPEED) <= 400000))

/** End of group I2C_clock_speed
  * @}
  */

/** @defgroup I2C_device_mode I2C Device Mode
  * @{
  */

#define I2C_DeviveMode_Master                   ((uint16_t)0x0041)
#define I2C_DeviveMode_Slave                    ((uint16_t)0x0000)

/** End of group I2C_device_mode
  * @}
  */

/** @defgroup I2C_address_mode I2C Address Mode
  * @{
  */

#define I2C_AddressMode_7BIT                    ((uint16_t)0x0000)
#define I2C_AddressMode_10BIT                   ((uint16_t)0x0001)

/** End of group I2C_address_mode
  * @}
  */

/** @defgroup I2C_acknowledgement I2C Acknowledgement
  * @{
  */

#define I2C_Ack_Enable                          ((uint16_t)0x0001)
#define I2C_Ack_Disable                         ((uint16_t)0x0000)

/** End of group I2C_acknowledgement
  * @}
  */

/** @defgroup I2C_flags_definition I2C Flags Definition
  * @{
  */

#define I2C_FLAG_SLV_ACTIVITY                   ((uint32_t)0x00000040)
#define I2C_FLAG_MST_ACTIVITY                   ((uint32_t)0x00000020)
#define I2C_FLAG_RFF                            ((uint32_t)0x00000010)
#define I2C_FLAG_RFNE                           ((uint32_t)0x00000008)
#define I2C_FLAG_TFE                            ((uint32_t)0x00000004)
#define I2C_FLAG_TFNF                           ((uint32_t)0x00000002)
#define I2C_FLAG_ACTIVITY                       ((uint32_t)0x00000001)

#define IS_I2C_GET_FLAG(FLAG) (((FLAG) == I2C_FLAG_SLV_ACTIVITY) || ((FLAG) == I2C_FLAG_MST_ACTIVITY) || \
                               ((FLAG) == I2C_FLAG_RFF) || ((FLAG) == I2C_FLAG_RFNE) || \
                               ((FLAG) == I2C_FLAG_TFE) || ((FLAG) == I2C_FLAG_TFNF) || \
                               ((FLAG) == I2C_FLAG_ACTIVITY))
/** End of group I2C_flags_definition
  * @}
  */

/** @defgroup I2C_transmit_Abort_Source I2C Transmit Abort Source
  * @{
  */

#define ABRT_SLVRD_INTX                         ((uint32_t)BIT(15))
#define ABRT_SLV_ARBLOST                        ((uint32_t)BIT(14))
#define ABRT_SLVFLUSH_TXFIFO                    ((uint32_t)BIT(13))
#define ARB_LOST                                ((uint32_t)BIT(12))
#define ABRT_MASTER_DIS                         ((uint32_t)BIT(11))
#define ABRT_10B_RD_NORSTRT                     ((uint32_t)BIT(10))
#define ABRT_SBYTE_NORSTRT                      ((uint32_t)BIT(9))
#define ABRT_HS_NORSTRT                         ((uint32_t)BIT(8))
#define ABRT_SBYTE_ACKDET                       ((uint32_t)BIT(7))
#define ABRT_HS_ACKDET                          ((uint32_t)BIT(6))
#define ABRT_GCALL_READ                         ((uint32_t)BIT(5))
#define ABRT_GCALL_NOACK                        ((uint32_t)BIT(4))
#define ABRT_TXDATA_NOACK                       ((uint32_t)BIT(3))
#define ABRT_10ADDR2_NOACK                      ((uint32_t)BIT(2))
#define ABRT_10ADDR1_NOACK                      ((uint32_t)BIT(1))
#define ABRT_7B_ADDR_NOACK                      ((uint32_t)BIT(0))

#define MS_ALL_ABORT                            (ARB_LOST | ABRT_MASTER_DIS | ABRT_TXDATA_NOACK |\
                                                 ABRT_10ADDR2_NOACK | ABRT_10ADDR1_NOACK | ABRT_7B_ADDR_NOACK)

