ART-Badge/SDK/libraries/src/app/wristband/inc/rtl876x_i2c_wristband.h
  * @retval None.
  */
void I2C_ClearINTPendingBit(I2C_TypeDef *I2Cx, uint16_t I2C_IT);

/**
  * @brief  Configure slave device address.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  Address: specifies the slave address which will be transmitte.
  * @retval None.
  */
__STATIC_INLINE void I2C_SetSlaveAddress(I2C_TypeDef *I2Cx, uint16_t Address)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Mask target address */
    I2Cx->IC_TAR &= ~((uint16_t)0x3ff);
    /* Configure new target address */
    I2Cx->IC_TAR |= Address & 0x3ff;
}

/**
  * @brief  write command through the I2Cx peripheral.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  *@param   command: command of write or read.
                  I2C_READ_CMD: read command. data which want to transmit can be 0 in this situation.
                  I2C_WRITE_CMD: write command.
  * @param  data: data which to be transmitted.
  *@param   StopState: command of write or read.
             I2C_STOP_ENABLE: send stop signal.
                  I2C_STOP_DISABLE: do not send stop signal.
  * @retval None.
  */
__STATIC_INLINE void I2C_SendCmd(I2C_TypeDef *I2Cx, uint16_t command, uint8_t data,
                                 uint16_t StopState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_CMD(command));
    assert_param(IS_I2C_STOP(StopState));

    I2Cx->IC_DATA_CMD = data | command | StopState;
}

/**
  * @brief  Returns the most recent received data by the I2Cx peripheral.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @retval The value of the received data.
  */
__STATIC_INLINE uint8_t I2C_ReceiveData(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    /* Return the data in the DR register */
    return (uint8_t)I2Cx->IC_DATA_CMD;
}

/**
  * @brief  read  data length in Rx FIFO through the I2Cx peripheral.
  * @param  I2Cx: where x can be 0 or 1
  * @retval None
  */
__STATIC_INLINE uint8_t I2C_GetRxFIFOLen(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    return (uint8_t)I2Cx->IC_RXFLR;
}

/**
  * @brief  read data length in Tx FIFO through the I2Cx peripheral.
  * @param  I2Cx: where x can be 0 or 1
  * @retval None
  */
__STATIC_INLINE uint8_t I2C_GetTxFIFOLen(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    return (uint8_t)I2Cx->IC_TXFLR;
}

/**
  * @brief clear all of I2C interrupt.
  * @param  I2Cx: where x can be 0 or 1
  */
__STATIC_INLINE void I2C_ClearAllINT(I2C_TypeDef *I2Cx)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));

    I2Cx->IC_CLR_INTR;
}

/**
  * @brief  Checks whether the specified I2C flag is set or not.
  * @param  I2Cx: where x can be 0 or 1 to select the I2C peripheral.
  * @param  I2C_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  *     @arg I2C_FLAG_SLV_ACTIVITY:
  *     @arg I2C_FLAG_MST_ACTIVITY:
  *     @arg I2C_FLAG_RFF:
  *     @arg I2C_FLAG_RFNE:
  *     @arg I2C_FLAG_TFE:
  *     @arg I2C_FLAG_TFNF:
  *     @arg I2C_FLAG_ACTIVITY:
  * @retval The new state of I2C_FLAG (SET or RESET).
  */
__STATIC_INLINE FlagStatus I2C_GetFlagState(I2C_TypeDef *I2Cx, uint32_t I2C_FLAG)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_GET_FLAG(I2C_FLAG));

    if ((I2Cx->IC_STATUS & I2C_FLAG) != (uint32_t)RESET)
    {
        /* I2C_FLAG is set */
        bit_status = SET;
    }

    /* Return the I2C_FLAG status */
    return  bit_status;
}

/**
  * @brief  Checks whether the last I2Cx Event is equal to the one passed
  *   as parameter.
  * @param  I2Cx: where x can be 1 or 2 to select the I2C peripheral.
  * @param  I2C_EVENT: specifies the event to be checked about I2C Transmit Abort Status Register.
  *   This parameter can be one of the following values:
  *     @arg ABRT_SLVRD_INTX
  *     @arg ABRT_SLV_ARBLOST
  *     @arg ABRT_SLVFLUSH_TXFIFO
  *     @arg ARB_LOST                   Master has lost arbitration
  *     @arg ABRT_MASTER_DIS          User tries to initiate a Master operation with the Master mode disabled
  *     @arg ABRT_10B_RD_NORSTRT
  *     @arg ABRT_SBYTE_NORSTRT
  *     @arg ABRT_HS_NORSTRT
  *     @arg ABRT_SBYTE_ACKDET
  *     @arg ABRT_HS_ACKDET
  *     @arg ABRT_GCALL_READ
  *     @arg ABRT_GCALL_NOACK
  *     @arg ABRT_TXDATA_NOACK   Master did not receive an acknowledge from the remote slave.
  *     @arg ABRT_10ADDR2_NOACK  Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave.
  *     @arg ABRT_10ADDR1_NOACK  Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave.
  *     @arg ABRT_7B_ADDR_NOACK   Master is in 7-bit addressing mode and th address sent was not acknowledged by any slave.
  * @retval An ErrorStatus enumeration value:
  * - SUCCESS: Last event is equal to the I2C_EVENT
  * - ERROR: Last event is different from the I2C_EVENT
  */
__STATIC_INLINE FlagStatus I2C_CheckEvent(I2C_TypeDef *I2Cx, uint32_t I2C_EVENT)
{
    FlagStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_I2C_EVENT(I2C_EVENT));

    if ((I2Cx->IC_TX_ABRT_SOURCE & I2C_EVENT) != (uint32_t)RESET)
    {

        bit_status = SET;
    }

    /* Return the I2C event status */
    return  bit_status;
}

/**
  * @brief Get the specified I2C interrupt status.
  * @param  I2Cx: where x can be 0 or 1.
  * @param  I2C_IT
  * This parameter can be one of the following values:
  *     @arg I2C_INT_GEN_CALL: Set only when a General Call address is received and it is acknowledged.
  *     @arg I2C_INT_START_DET: Indicates whether a START or RESTART condition has occurred on the I2C
                              interface regardless of whether DW_apb_i2c is operating in slave or master mode.
  *     @arg I2C_INT_STOP_DET:  Indicates whether a STOP condition has occurred on the I2C interface regardless
                              of whether DW_apb_i2c is operating in slave or master mode
  *     @arg I2C_INT_ACTIVITY:  This bit captures DW_apb_i2c activity and stays set until it is cleared.
  *     @arg I2C_INT_RX_DONE:   When the DW_apb_i2c is acting as a slave-transmitter, this bit is set to 1 if the
                              master does not acknowledge a transmitted byte. This occurs on the last byte of
                              the transmission, indicating that the transmission is done.
  *     @arg I2C_INT_TX_ABRT:   This bit indicates if DW_apb_i2c, as an I2C transmitter, is unable to complete the
                              intended actions on the contents of the transmit FIFO.
  *     @arg I2C_INT_RD_REQ:    This bit is set to 1 when acting as a slave and another I2C master
                              is attempting to read data.
  *     @arg I2C_INT_TX_EMPTY:  This bit is set to 1 when the transmit buffer is at or below the threshold value set
                              in the IC_TX_TL register.
  *     @arg I2C_INT_TX_OVER:   Set during transmit if the transmit buffer is filled to IC_TX_BUFFER_DEPTH and
                              the processor attempts to issue another I2C command.
  *     @arg I2C_INT_RX_FULL:   Set when the receive buffer reaches or goes above the RX_TL threshold in the
                              IC_RX_TL register
  *     @arg I2C_INT_RX_OVER:   Set if the receive buffer is completely filled to IC_RX_BUFFER_DEPTH and an
                               additional byte is received from an external I2C device.
  *     @arg I2C_INT_RX_UNDER:   Set if the processor attempts to read the receive buffer when it is empty by reading.
  * @retval The new state of I2C_IT (SET or RESET).
  */
__STATIC_INLINE ITStatus I2C_GetINTStatus(I2C_TypeDef *I2Cx, uint32_t I2C_IT)
{
    ITStatus bit_status = RESET;

    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(I2C_GET_INT(I2C_IT));

    if ((I2Cx->IC_INTR_STAT & I2C_IT) != (uint32_t)RESET)
    {

        bit_status = SET;
    }

    /* Return the I2C_IT status */
    return  bit_status;
}

/**
  * @brief  Enables or disables the I2Cx GDMA interface.
  * @param  I2Cx: where x can be 0 or 1
  * @param  I2C_GDMAReq: specifies the I2C GDMA transfer request to be enabled or disabled.
  *   This parameter can be one of the following values:
  *     @arg I2C_GDMAReq_Tx: Tx buffer GDMA transfer request
  *     @arg I2C_GDMAReq_Rx: Rx buffer GDMA transfer request
  * @param  NewState: new state of the selected I2C GDMA transfer request.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
__STATIC_INLINE void I2C_GDMACmd(I2C_TypeDef *I2Cx, uint16_t I2C_GDMAReq, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_I2C_ALL_PERIPH(I2Cx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));
    assert_param(IS_I2C_GDMAREQ(I2C_GDMAReq));

    if (NewState != DISABLE)
    {
        /* Enable the selected I2C GDMA request */
        I2Cx->IC_DMA_CR |= I2C_GDMAReq;
    }
    else
    {
        /* Disable the selected I2C GDMA request */
        I2Cx->IC_DMA_CR &= (uint16_t)~(I2C_GDMAReq);
    }
}

#ifdef __cplusplus
}
#endif

#endif /*__RTL8762X_I2C_H*/

/** @} */ /* End of group I2C_Exported_Functions */
/** @} */ /* End of group I2C */

/******************* (C) COPYRIGHT 2015 Realtek Semiconductor Corporation *****END OF FILE****/

